Repository: Daniel-KM/ArchiveFolder
Catalog: languages/*.po
Languages: fr

source: The file path "%s" is not correct.
fr: Le chemin du fichier "%s" n'est pas correct.

source: There is no record #%d.
fr: Il n'y a pas de notice n° %d.

source: The record #%d is empty.
fr: La notice n° %d est vide.

source: The record #%d doesn't exist.
fr: La notice n° %d n'existe pas.

source: The action "%s" has no effect.
fr: L'action "%s" n'a pas d'effet.

source: The action "%s" is replaced by a creation.
fr: L'action "%s" est remplacée par une création.

source: Cannot process action "%s" for record #%d: the record exists (%s id %d).
fr: Impossible de traiter l'action "%s" pour la notice n° %d : la notice existe (%s id %d).

source: Cannot create a second record with the same identifier (record #%d).
fr: Impossible de créer une seconde notice avec le même identifiant (notice n° %d).

source: Action "%s" does not exist.
fr: L'action "%s" n'existe pas.

source: The file "%s" cannot be created before the item.
fr: Le fichier "%s" ne peut pas être créé avant le document.

source: Local paths are not allowed by the administrator (%s) [%s].
fr: Les chemins locaux ne sont pas autorisés par l'administrateur (%s) [%s].

source: Error occurred when attempting to ingest "%s" as a file: %s
fr: Une erreur est survenue en essayant d'ingérer "%s" en tant que fichier : %s

source: Only update actions are allowed here, not "%s".
fr: Seules les actions de mise à jour sont autorisées ici, pas "%s".

source: The record type "%s" is not the same than the record to update ("%s").
fr: Le type de notice "%s" n'est pas le même que celle à mettre à jour ("%s").

source: Record type "%s" is not allowed.
fr: Le type de notice "%s" n'est pas autorisé.

source: Unable to delete the record: %s
fr: Impossible de supprimer la notice : %s

source: Unable to delete this record: %s
fr: Impossible de supprimer cette notice : %s

source: The repository file "%s" does not exist.
fr: Le fichier

source: The repository file "%s" is not an xml one.
fr: Le fichier d'entrepôt "%s" n'est pas un fichier xml.

source: Cannot archive the record %s #%d [index #%d].
fr: Impossible d'archiver la notice de %s n° %d [index n° %d].

source: Folder cannot be empty.
fr: Le dossier ne peut pas être vide.

source: Type of record "%s" is not correct.
fr: Le type d'enregistrement "%s" n'est pas correct.

source: Parameters must be an array. Instead, the following was given: %s.
fr: Les paramètres doivent être un tableau. Ce type a été soumis à la place : %s.

source: Anonymous
fr: Anonyme

source: Parameters must be an array.
fr: Les paramètres doivent être un tableau.

source: An url or a path is required to add a folder.
fr: Une url ou un chemin est nécessaire pour ajouter un dossier.

source: The url or path should be written in a standard way.
fr: L'url ou le chemin doit être écrit de manière standard.

source: There is no repository identifier.
fr: Il n'y a pas d'identifiant d'entrepôt.

source: The folder for uri "%s" exists already.
fr: Le dossier pour l'uri "%s" existe déjà.

source: The repository identifier "%s" exists already.
fr: L'identifiant de l'entrepôt "%s" existe déjà.

source: The status "%s" does not exist.
fr: Le statut "%s" n'existe pas.

source: Process "%s" started.
fr: Le traitement "%s" a commencé.

source: Error during process: %s
fr: Erreur durant le traitement : %s

source: Unknown error during process: %s
fr: Erreur inconnue durant le traitement : %s

source: Process has been stopped by user.
fr: Le traitement a été arrêté par l'utilisateur.

source: Folder #%d [%s]: Check finished.
fr: Dossier n° %d [%s] : Vérification terminée.

source: List of records ready.
fr: Liste des notices prête.

source: The process can't be launched, because the folder is not ready.
fr: Le traitement n'a pas pu être lancé, car le dossier n'est pas prêt.

source: Folder "%s" has been processed.
fr: Le dossier "%s" a été traité.

source: Folder "%s" is being processed.
fr: Le dossier "%s" est en cours de traitement.

source: No document or resource unavailable.
fr: Pas de document ou ressource indisponible.

source: Result: %d items and %d files.
fr: Résultat : %d documents et %d fichiers.

source: This folder has no record to process.
fr: Ce dossier n'a pas de notice à traiter.

source: All %d records have already been processed.
fr: Les %d notices ont toutes déjà été traitées.

source: Folder is not ready to be processed.
fr: Le dossier n'est pas prêt à être traité.

source: Process of record #%d/%d started.
fr: Le traitement de la notice n° %d/%d a commencé.

source: Error during import of record #%d/%d: %s
fr: Erreur durant l'import du dossier n° %d/%d : %s

source: Unknown error during import of record #%d/%d: %s
fr: Erreur inconnue durant l'import de la notice n° %d/%d: %s

source: Process of record #%d/%d finished.
fr: Traitement de la notice n° %d/%d terminé.

source: All %d records have been processed.
fr: Les %d notices ont toutes été traitées.

source: Process of record #%d/%d failed.
fr: Le traitement de la notice n° %d/%d a échoué.

source: Notice
fr: Avis

source: Debug
fr: Débogage

source: Del. records
fr: Suppr. docs

source: Delete all imported records
fr: Supprimer tous les documents importés

source: Are your sure to remove all imported records of this folder?
fr: Êtes-vous certain de supprimer tous les documents importés à partir de ce dossier ?

source: Command of the processor.
fr: Commande du processeur

source: Let empty to use the internal xslt processor of php.
fr: Laisser vide pour utiliser le processeur xslt de php.

source: %d document was skipped because of a forbidden extension: "%s".
fr: %d document a été écarté en raison d'une extension interdite : "%s".

source: The folder "%s" is not readable.
fr: Le dossier "%s" ne peut pas être lu.

source: The input file "%s" is not readable.
fr: Le fichier en entrée "%s" ne peut pas être lu.

source: Folder is not ready to be processed (status: %s).
fr: Le dossier n’est pas prêt pour être traité (statut : %s).

source: An error occured during import.
fr: Une erreur est survenue durant l’import.

source: You should relaunch the process (imported items won't be reimported).
fr: Vous devez relancer le traitement (les documents importés ne seront pas réimportés).

source: The imported records cannot be removed: the status should be "completed" or "reset", not "%s".
fr: Les notices importées ne peuvent pas être supprimées : le statut doit être "complété" ou "réinitailisé" et non pas "%s".

source: No record have been imported, so no record can be removed.
fr: Aucune notice n’a été importée et aucune notice ne peut donc être supprimée.

source: Removed record #%d/%d (%s #%d).
fr: Notice supprimée n° %d/%d (%s n° %d).

source: All %d imported records (%d collections, %d items, %d files) have been removed.
fr: Les %d notices importées (%d collections, %d documents, %d fichiers) ont été supprimées.

source: Delete records
fr: Supprimer les documents

source: WARNING: Updated records will be removed too.
fr: ATTENTION : les documents mis à jour seront également supprimés.

source: The file "%s" inside document "%s" is incorrect.
fr: Le fichier "%s" à l’intérieur du document "%s" est incorrect.

source: The record type "%s" is not managed.
fr: Le type de document "%s" n’est pas géré.

source: Failed to execute command: %s
fr: Échec de la commande : %s

source: The remote file "%s" is not readable or empty.
fr: Le fichier distant "%s" n’est pas lisible ou vide.

source: name "%s"
fr: nom "%s"

source: no name
fr: pas de nom

source: Cannot archive the record %s #%d [index #%d, %s].
fr: Impossible d’archiver la notice %s n° %d [index #%d, %s].

source: Result: %d collections, %d items and %d files.
fr: Résultat : %d collections, %d documents et %d fichiers.

source: All %d records have been processed (%d managed).
fr: Les %d notices ont toutes été traitées (%d gérées).

source: (%d already deleted, including files of items)
fr: (%d déjà supprimés, y compris les fichiers des documents)

source: All %d imported records (%d collections, %d items, %d files) have been removed%s.
fr: Les %d notices importées (%d collections, %d documents, %d fichiers) ont été supprimées%s.
