Repository: Daniel-KM/ArchiveFolder
Catalog: languages/*.po
Languages: fr

source: Add a new folder to archive
fr: Ajouter un nouveau dossier à archiver

source: Fill infos about the folder to prepare.
fr: Indiquer les infos sur le dossier à préparer

source: Don't forget to allow used extensions and mime-types in %sparameters%s, in particular "xml".
fr: Ne pas oublier d'autoriser les extensions utilisées et les mime-types dans les %sparamètres%s, en particulier "xml".

source: Currently, these parameters are not editable once saved, but they can be deleted and rebuilt easily.
fr: Actuellement, ces paramètres ne sont pas éditables une fois sauvés, mais ils peuvent être supprimés et reconstruit facilement.

source: Archive Folders (%d total)
fr: Dossiers d'archive (%d au total)

source: Add a new archive folder
fr: Ajouter un nouveau dossier à archiver

source: Status of Archive Folders
fr: Statuts des dossiers d'archives

source: Check
fr: Vérifier

source: Process
fr: Traiter

source: Refresh page
fr: Rafraîchir la page

source: Delete
fr: Supprimer

source: Folder
fr: Dossier

source: Folder Status
fr: Statut du dossier

source: Last Modified
fr: Dernière modification

source: No message
fr: Pas de message

source: Last Messages
fr: Derniers messages

source: All Messages
fr: Tous les messages

source: Stop
fr: Arréter

source: Reset status
fr: Réinitialiser le statut

source: Are your sure to remove these folders?
fr: Êtes-vous sûr de supprimer ces dossiers ?

source: The query searched %s records and returned no results.
fr: La requête a cherché parmi %s documents et n'a retourné aucun résultat.

source: See all folders.
fr: Afficher tous les dossiers.

source: No url or path have been checked or exposed.
fr: Aucun url ou chemin n'a été vérifié ou exposé.

source: Archive Folder
fr: Dossiers d'archive

source: Logs for folder "%s".
fr: Logs pour le dossier "%s".

source: Current status: %s.
fr: Statut actuel : %s

source: Time
fr: Heure

source: This archive folder has no message yet.
fr: Ce dossier d'archive n'a pas encore de message.

source: This is not an archive folder.
fr: Ce n'est pas un dossier d'archive.

source: Back to %sArchive Folder%s.
fr: Retour aux %sdossiers d'archive%s.

source: Command of the processor
fr: Commande pour le processeur

source: Command of the processor. Let empty to use the internal xslt processor of php.
fr: Commande du processeur. Laisser vide pour utiliser le processeur xslt interne à php.

source: This is required by some formats that need to parse a xslt 2 stylesheet.
fr: Ce processeur est nécessaire pour les formats qui utilisent une feuille de style xslt 2.

source: See format of the command and examples in the readme.
fr: Voir le format de la commande et les exemples dans le readme.

source: Short Job Dispatcher
fr: Utiliser les tâches courtes

source: Processing a folder and import files is usually a long job.
fr: Traiter un dossier et importer les fichiers constituent généralement des tâches longues.

source: Nevertheless, some configurations don't allow to process them.
fr: Néanmoins, certaines configurations empêchent de les traiter.

source: So, if checked, the short dispatcher will be used, but by default, servers limit them to about 30 seconds.
fr: De ce fait, lorsque cette option est cochée, le répartiteur utilisera les tâches courtes, mais par défaut, les serveurs les limitent à 30 secondes.

source: Slow the process
fr: Ralentir le traitement

source: Some providers check if too many files are uploaded in one shot and prevent the import.
fr: Certains hébergeurs vérifient si un nombre trop élevé de fichiers sont téléchargés en même temps et l'empêchent.

source: This option sleeps the process during this number of seconds to avoid such a limit.
fr: Cette option ralentit le traitement durant le nombre de secondes spécifiées pour éviter ce type de limitation.

source: Memory Limit
fr: Limite de la mémoire

source: The memory limit for the background processes.
fr: La limite de la mémoire pour les traitements en arrière-plan.

source: Rights and Roles
fr: Droits et rôles

source: Roles that can use Archive Folder
fr: Rôles pouvant utiliser Archive Folder

source: Quick Filter
fr: Filtre rapide

source: View All
fr: Afficher tout

source: Status Ready
fr: Statut Prêt

source: Status Processing
fr: Statut En cours de traitement

source: Status Error
fr: Statut Erreur

source: Folder added
fr: Dossier ajouté

source: Status reset
fr: Statut Réinitialisé

source: Process queued
fr: Traitement mis en file

source: Process in progress
fr: Traitement en cours

source: Process paused
fr: Traitement en pause

source: Process stopped
fr: Traitement arrêté

source: Process killed
fr: Traitement détruit

source: Process completed
fr: Traitement complété

source: Folder deleted
fr: Dossier supprimé

source: Process Error
fr: Erreur de traitement

source: Error
fr: Erreur

source: Order files
fr: Trier les fichiers

source: Order files of each item by their original filename.
fr: Trier les fichiers de chaque document par leur nom original.

source: Mix images and other files
fr: Mélanger les images et les autres fichiers.

source: If checked, types will be mixed, else images will be ordered before other files.
fr: Si coché, les types de fichiers seront mélangés, sinon les images seront triés avant les autres fichiers.

source: The folder "%s" where the xml files of the documents are saved will not be removed automatically.
fr: Le dossier "%s" dans lequel les fichiers xml des documents sont sauvegardés n'est pas automatiquement supprimé.

source: Archive Folders
fr: Dossiers d'archive

source: Documents xml (simple format that manages all features of Omeka)
fr: Documents xml (format simple qui gère l'ensemble des fonctionnalités d'Omeka)

source: Text (extension: ".metadata.txt")
fr: Texte (extension: ".metadata.txt")

source: METS xml (with a profile compliant with Dublin Core)
fr: METS xml (avec un profil compatible avec le Dublin Core)

source: There was an error on the form. Please try again.
fr: Il y a une erreur sur le formulaire. Merci de réessayer.

source: Folder #%d does not exist.
fr: Le dossier n°%d n'existe pas.

source: Process has been stopped.
fr: Le traitement a été arrêté.

source: You must choose some folders to batch edit.
fr: Vous devez choisir des dossier pour les éditer en log.

source: Folder # %d does not exist.
fr: Le dossier n° %d n'existe pas.

source: Error when processing folder.
fr: Erreur lors du traitement du dossier.

source: Folder "%s" (#%d): %s
fr: Dossier "%s" (n° %d) : %s

source: Folder "%s" has been updated.
fr: Le dossier "%s" a été mis à jour.

source: Folder "%s" is being updated.
fr: Le dossier "%s" est en cours de mise à jour.

source: This may take a while. Please check below for status.
fr: Cela peut prendre un moment. Mercie de vérifier le statut ci-dessous.

source: When a folder is removed, the static repository file and the imported collections, items and files are not deleted from Omeka.
fr: Quand un dossier est supprimé, le fichier d'entrepôt statique et les collections importés, documents et fichiers ne sont pas supprimés d'Omeka.

source: Class "%s" does not exists.
fr: La classe "%s" n'existe pas.

source: The folder cache is not set.
fr: Le dossier de cache n'est pas défini.

source: The folder cache is incorrect.
fr: Le dossier de cache est incorrect.

source: Result for file "%s" (prefix "%s") is not readable.
fr: Le résultat pour le fichier "%s" (prefix "%s") ne peut être lu.

source: The file "%s" is not recognized as format "%s".
fr: Le fichier "%s" n'est pas reconnu en tant que format "%s".

source: This test requires php 5.4.0 or higher.
fr: Ce test requiert php 5.4.0 ou supérieur.

source: The list of documents for file "%s" (prefix "%s") is not correct.
fr: La liste des documents pour le fichier "%s" (préfixe "%s") n'est pas correct.

source: Some file for the mapping test are not ready: "%s".
fr: Certains fichiers pour le test de mapping ne sont pas prêts : "%s"

source: Local paths are not allowed by the administrator.
fr: Les chemins locaux ne sont pas autorisés par l'administrateur.

source: The path "../file_2.png" is forbidden or incorrect.
fr: Le chemin "../file_2.png" est interdit ou incorrect.

source: The uri "%s" is not allowed.
fr: L'uri "%s" n'est pas autorisée.

source: No test for non-latin characters via http.
fr: Pas de test pour les caractères non-latins via http.

source: To be done: replace "document.xml" by the updated one.
fr: À finaliser : remplacer le "document.xml" par un fichier mis à jour.

source: This test requires OcrElementSet.
fr: Ce test requiert OcrElementSet.

source: Test for updates should be done.
fr: Le test pour les mises à jour doit être réalisé.

source: The folder uri or the transfer mode cannot be checked: %s
fr: L'uri du dossier ou le mode de transfert ne peut pas être vérifié : %s

source: The format of the uri is not managed.
fr: Le format de l'uri n'est pas géré.

source: Mappings cannot be checked: %s
fr: Les mappings ne peuvent pas être vérifiés : %s

source: Files cannot be checked: %s
fr: Les fichiers ne peuvent pas être vérifiés : %s

source: No folder and no file found after listing files.
fr: Aucun dossier ou fichier n'a été trouvé après avoir listé les fichiers.

source: Check your rights and your configuration.
fr: Vérifier les droits et la configuration.

source: Some extensions of paths cannot be checked: %s
fr: Certaines extensions et chemins ne peuvent pas être vérifiés : %s

source: No folder and no file found after checking files.
fr: Aucun dossier ou fichier n'a été trouvé après avoir vérifié les fichiers.

source: Check rights, allowed paths, extensions and configuration.
fr: Vérifier les droits, les chemins autorisés, les extensions et la configuration.

source: The static repository cannot be built: %s
fr: L'entrepôt statique ne peut pas être construit : %s

source: Some documents cannot be imported: %s
fr: Certains documents ne peuvent pas être importés : %s

source: No folder and no file found after checking documents.
fr: Aucun dossier ou fichier n'a été trouvé après avoir vérifié les documents.

source: Check rights, allowed paths, extensions, configuration, the metadata in your files or the xsl processing.
fr: Vérifier les droits, les chemins autorisés, les extensions, la configuration, les métadonnées dans les fichiers ou le traitement xsl.

source: The repository identifier is not defined.
fr: L'identifiant de l'entrepôt n'est pas défini.

source: An error occurs when the file of the static repository was saved: %s
fr: Une erreur est survenue lors de l'enregistrement du fichier de l'entrepôt statique : %s

source: The folder is not readable or not available.
fr: Le dossier n'est pas lisible ou n'est pas disponible.

source: Mapping class "%s" is missing.
fr: La classe de mapping "%s" est manquante.

source: %d files were skipped because of a forbidden extension: "%s".
fr: %d fichiers ont été écartés car ils ont une extension interdite : "%s".

source: Folder #%d [%s]: %s
fr: Dossier n° %d [%s] : %s

source: %d forbidden files were skipped: "%s".
fr: %d fichiers interdits ont été écartés : "%s"

source: The document "%s" has an issue: %s
fr: Le document "%s" a un problème : %s

source: Some files are not manageable "%s".
fr: Certains fichiers ne peuvent pas être gérés "%s".

source: %d documents were skipped because of a forbidden extension: "%s".
fr: %d documents ont été écartés à cause d'une extension interdite : "%s".

source: %d forbidden documents were skipped: "%s".
fr: %d documents interdits ont été écartés : "%s".

source: Folder #%d [%s]: "%s"
fr: Dossier n° %d [%s] : "%s"

source: The static repository has not been created.
fr: L'entrepôt statique n'a pas été créé.

source: The static repository cannot be copied in destination folder.
fr: L'entrepôt statique ne peut pas être copié dans le dossier de destination.

source: The base path is not correct.
fr: Le chemin de base n'est pas correct.

source: The uri "%s" is not correct.
fr: L'uri "%s" n'est pas correcte.

source: There is no path for the file.
fr: Il n'y a pas de chemin pour le fichier.

source: The record type "%s" is incorrect.
fr: Le type de document "%s" est incorrect.

source: The filepath for document "%s" is empty.
fr: Le chemin pour le document "%s" est vide.

source: The file "%s" is incorrect.
fr: Le fichier "%s" est incorrect.

source: The file path "%s" is incorrect.
fr: Le chemin du fichier "%s" est incorrect.

source: The record type "%s" does not exist.
fr: Le type de notice "%s" n'existe pas.

source: The action "%s" does not exist.
fr: L'action "%s" n'existe pas.

source: The path "%s" is forbidden or incorrect.
fr: Le chemin "%s" est interdit ou incorrect.

source: The collection "%s" does not exist.
fr: La collection "%s" n'existe pas.

source: The item type "%s" does not exist.
fr: Le type de document "%s" n'existe pas.

source: The item type id "%d" does not exist.
fr: Le numéro du type de document "%d" n'existe pas.

source: The identifier field "%s" is not allowed for the record type "%s".
fr: Le champ d'identifiant "%s" n'est pas autorisé pour le type de notice "%s".

source: Base URI
fr: URI de base

source: The base url or path of the folder to expose.
fr: L'url de base ou le chemin pour à exposer.

source: If url, the server should allow directory listing.
fr: Si c'est une url, le serveur doit autoriser le listage du dossier.

source: Local paths are forbidden by the administrator.
fr: Les chemins locaux sont interdits par les administrateurs.

source: A url or a path is required to add a folder.
fr: Une url ou un chemin est requis pour ajouter un dossier.

source: Unreferenced Files
fr: Fichiers non référencés

source: This option indicates what to do with files, maybe all of them, that are not referenced inside metadata files ("%s").
fr: Cette option indique quoi faire avec les fichiers, éventuellement tous, qui ne sont pas référencés à l'intérieur d'un fichier de métadonnées ("%s").

source: One item by file
fr: Un document par fichier

source: One item by directory
fr: Un document par dossier

source: Skip
fr: Écarter

source: File extensions to exclude
fr: Extensions de fichier à exclure

source: A black-list of extensions (normal or double) to exclude from the source, separated by a space or a comma and without the initial dot.
fr: Une liste noire d'extensions (simple ou double) à exclure de la source, séparées par une espace ou une virgule et sans le point initial.

source: The white-list is the Omeka one, defined in the security page.
fr: La liste blanche est celle d'Omeka, défini dans la page de sécurité.

source: Allow file without extension
fr: Autoriser les fichiers sans extension.

source: This option allows to import some specific files and urls.
fr: Cette option permet d'importer certains fichiers spécifiques et des urls.

source: The option "Disable File Upload Validation" in Settings > Security should be set too.
fr: L'option "Désactiver la validation pour le téléchargement de fichier" dans "Paramètres > Sécurité doit également être activé.

source: No default item type
fr: Pas de type de document par défaut

source: Default type according to first file of each item
fr: Type de document défini en fonction du premier fichier de chaque document

source: Default Item Type
fr: Type de document par défaut

source: Set the item type during import as Omeka Item Type and Dublin Core Type.
fr: Définit le type de document lors de l'import en tant que Omeka Item Type et Dublin Core Type.

source: For the second option (type of the first file), it can be:
fr: Pour la seconde option (type du premier fichier), cela peut être :

source: "Still image" for an item with a single Image, "Text" for an item with multiple image or a pdf, "Sound" for an audio file, "Moving Image" for a video file and none in all other cases.
fr: "Image fixe" pour un document avec une simple image, "Texte" pour un document avec de multiples images ou un pdf, "Son" pour un fichier audio, "Image animée" pour un fichier vidéo et aucun dans tous les autres cas.

source: Add unique identifiers
fr: Ajouter des identifiants uniques

source: To add unique identifiers allows to link items and files easily and independantly from Omeka.
fr: Ajouter des identifiants uniques permet de lier les documents et les fichiers facilement et indépendamment d'Omeka.

source: Added identifiers are absolute urls.
fr: Les identifiants ajoutés sont des urls absolus.

source: This option is only usefull when there aren't such identifiers.
fr: Cette option est utile seulement lorsqu'il n'y a pas d'identifiant.

source: Table/Spreadsheet element separator
fr: Séparateur d'élément pour tableau/tableur

source: If metadata are available in a table (as Open Document Spreadsheet ods), multiple elements can be set within one cell for the same field.
fr: Si des métadonnées sont disponibles dans un tableau (au format Open Document Spreadsheet ods), plusieurs éléments peuvent être définis dans une seule cellule pour le même champ.

source: This character or this string, for example the pipe "|", can be used to delimite them.
fr: Ce caractère ou cette chaîne, par exemple le tube "|", peut être utilisé pour les délimiter.

source: If the delimiter is empty, then the whole text will be used.
fr: Si le délimiter est vide, alors le texte complet sera utilisé.

source: Anyway, multiple columns can be mapped to the same element and multiple rows can manage multiple values for the same field of the same record.
fr: De toute façon, plusieurs colonnes peuvent contenir le même élément et plusieurs lignes peuvent gérer plusieurs valeurs pour le même champ de la même notice.

source: Table/Spreadsheet empty value
fr: Valeur vide pour un tableau/tableur

source: If metadata are available in a table (as Open Document Spreadsheet ods), an empty cell can be an empty value or no value.
fr: Si des métadonnées sont disponibles dans un tableau (au format Open Document Spreadsheet ods), une cellule vide peut correspondre à une valeur vide ou à une absence de valeur.

source: To distinct these two cases, an empty value can be replaced by this string (case sensitive).
fr: Pour distinguer ces deux cas, une valeur vide peut être remplacée par une chaîne (sensible à la casse).

source: Add specific parameters
fr: Ajouter des paramètres spécifiques

source: Some formats require specific parameters, for example to be used in the xsl sheets.
fr: Certains formats nécessitent des paramètres spécifiques, par exemple pour être utilisé dans les feuilles xsl.

source: You can specify them here, one by line.
fr: Vous pouvez les spécifier ici, un par ligne.

source: parameter_1_name = parameter 1 value
fr: paramètre_1_nom = paramètre 1 valeur

source: Each extra parameter, one by line, should have a name separated from the value with a "=".
fr: Chaque paramètre complémentaire, un par ligne, doit avoir un nom séparé de la valeur avec un "=".

source: No default identifier field
fr: Pas de champ d'identifiant par défaut

source: Internal id
fr: Id interne

source: Identifier field (required)
fr: Champ d'identifiant (requis)

source: The identifier field is used to simplify the update of records.
fr: Le champ d'identifiant est utilisé pour simplifier la mise à jour des notices.

source: This is the link between the files in the folder and the records in the Omeka base.
fr: C'est un lien entre les fichiers dans le dossier et les notices dans la base Omeka.

source: The identifier should be set and unique in all records (collections, items, files).
fr: L'identifiant doit être défini et unique pour toutes les notices (collections, documents, fichiers).

source: This is generally the Dublin Core : Identifier or a specific element.
fr: C'est généralement le Dublin Core : Identifiant ou un élément spécifique.

source: Update the record if it exists, else create one
fr: Mettre à jour la notice si elle existe, sinon en créer une

source: Create a new record
fr: Créer une nouvelle notice

source: Update values of specific fields
fr: Mettre à jour les valeurs des champs spécifiques

source: Add values to specific fields
fr: Ajouter des valeurs aux champs spécifiques

source: Replace values of all fields
fr: Remplacer les valeurs de tous les champs

source: Delete the record
fr: Supprimer la notice

source: Skip process of the record
fr: Ne pas traiter la notice

source: No default action
fr: Pas d'action par défaut

source: The action defines how records and metadara are processed.
fr: L'action définit comment les notices et les métadonnées sont traitées.

source: The record can be created, updated, deleted or skipped.
fr: La notice peut être créée, mise à jour, supprimé ou sauté.

source: The metadata of an existing record can be updated, appended or replaced.
fr: Les métadonnées des notices existantes peuvent être mises à jour, complétées ou remplacées.

source: Archive Folder URI
fr: URI du dossier d'archive

source: Archive Folder Records and files
fr: Notices et fichiers du dossier d'archive

source: Set parameters to create each record from files.
fr: Définir les paramètres pour créer chaque notice à partir des fichiers.

source: An item can have multiple files, and items and files can have different metadata.
fr: Un document peut avoir plusieurs fichiers et les documents et les fichiers peuvent avoir des métadonnées différentes.

source: For example, a record of a book can have each digitalized page attached to it.
fr: Par exemple, chaque page numérisée d'un livre peut avoir la notice qui lui est rattachée.

source: An object can have multiple pictures under different views or taken by different photographers.
fr: Un objet peut avoir plusieurs photos prises sous différentes vues ou prises par différents photographes.

source: In that case, it is recommended to separate the metadata, for example to add data about each page or the different authors of the view.
fr: Dans tous les cas, il est recommandé de séparer les métadonnées, par exemple pour ajouter des données concernant chaque page ou les différents auteurs d'une vue.

source: Conversely, an image of a paint, a photography, or a book digitalized as a pdf and e-book files doesn't need to have separate records.
fr: À l'inverse, une image d'une peinture, une photographie ou un livre numérisé en pdf ou en ebook ne nécessitent pas d'avoir des notices séparées.

source: Tables
fr: Tableaux

source: Set specific parameters for table or spreadsheets.
fr: Indiquer les paramètres spécifiques pour les tableaux ou les tableurs.

source: Extra Parameters
fr: Autres paramètres

source: Add folder
fr: Ajouter un dossier

source: Unable to process folder #%d, it does not exist.
fr: Impossible de traiter le dossier n° %d, il n'existe pas.

source: The folder for uri "%s" (# %d) was deleted prior to running this job.
fr: Le dossier pour l'uri "%s" (n° %d) a été supprimé avant de traiter cette tâche.

source: Error when processing folder "%s" (#%d): %s
fr: Erreur lors du traitement du dossier "%s" (n° #d) : %s

source: An error occurs during the xsl transformation of the file "%s" with the sheet "%s".
fr: Une erreur est survenue lors de la transformation xsl du fichier "%s" avec la feuille "%s".

source: Could not load "%s". Verify that you have rights to access this folder and subfolders.
fr: Impossible de charger "%s". Vérifier les droits d'accès à ce dossier et aux sous-dossiers.

source: The file "%s" is empty. Process is aborted.
fr: Le fichier "%s" est vide. Le traitement est annulé.

source: An error occurs during the xsl transformation of the file "%s" with the sheet "%s" : %s
fr: Une erreur est survenue lors de la transformation xsl du fichier "%s" avec la feuille "%s" : %s

source: The main uri should be set to use the class "ArchiveFolder_Tool_ManagePaths".
fr: L'uri principale doit être définie pour utiliser la classe "ArchiveFolder_Tool_ManagePaths".
